<a href="https://colab.research.google.com/github/Poorviga29/Local-Food-Wastage-Management-System/blob/main/local_food_waste_management_system.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### <center><h2> LOCAL FOOD WASTAGE MANAGEMENT SYSTEM </h2></center>

#### Imported the libraries

In [ ]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings("ignore", category=UserWarning)
import os
import re
import sqlite3

#### Load the data from CSV files

In [ ]:
# Load data from CSV files
providers = pd.read_csv("providers_data.csv")
receivers = pd.read_csv("receivers_data.csv")
food_listings = pd.read_csv("food_listings_data.csv")
claims = pd.read_csv("claims_data.csv")

In [ ]:
providers

,Provider_ID,Name,Type,Address,City,Contact
0,1,Gonzales-Cochran,Supermarket,"74347 Christopher Extensions\nAndreamouth, OK ...",New Jessica,+1-600-220-0480
1,2,"Nielsen, Johnson and Fuller",Grocery Store,"91228 Hanson Stream\nWelchtown, OR 27136",East Sheena,+1-925-283-8901x6297
2,3,Miller-Black,Supermarket,"561 Martinez Point Suite 507\nGuzmanchester, W...",Lake Jesusview,001-517-295-2206
3,4,"Clark, Prince and Williams",Grocery Store,"467 Bell Trail Suite 409\nPort Jesus, IA 61188",Mendezmouth,556.944.8935x401
4,5,Coleman-Farley,Grocery Store,"078 Matthew Creek Apt. 319\nSaraborough, MA 53978",Valentineside,193.714.6577
...,...,...,...,...,...,...
995,996,"Vasquez, Ruiz and Flowers",Restaurant,"84308 Justin Stravenue\nNew Amberside, NE 53447",Williamview,+1-319-378-7627x0682
996,997,Garza-Williams,Catering Service,"08864 Figueroa Radial Suite 948\nJennaberg, AZ...",East Rossside,001-924-441-3963x746
997,998,Novak Group,Grocery Store,"934 Zachary Run\nMelissamouth, WY 02729",Joshuastad,(903)642-1969x3300
998,999,Moody Ltd,Grocery Store,"17580 Ernest Hills\nLake Michaelmouth, OR 56416",Stevenchester,637.300.3664x4880
999,1000,Jenkins-Brooks,Restaurant,"53390 Evans Rapids Suite 982\nLake Meghan, MO ...",Brendantown,266-324-3458x95775

In [ ]:
receivers

,Receiver_ID,Name,Type,City,Contact
0,1,Donald Gomez,Shelter,Port Carlburgh,(955)922-5295
1,2,Laurie Ramos,Individual,Lewisburgh,761.042.1570
2,3,Ashley Mckee,NGO,South Randalltown,691-023-0094x856
3,4,Erika Rose,NGO,South Shaneville,8296491111
4,5,John Romero,Individual,Bakerport,067.491.0154
...,...,...,...,...,...
995,996,Matthew Curtis,Shelter,Lanechester,127-889-4442x1289
996,997,Amanda Cain,NGO,New Steven,+1-001-491-5601x5316
997,998,Theodore Briggs,Individual,South Sandra,930-609-9442x5031
998,999,Cheyenne Ramsey,NGO,Lake Jeffery,001-326-320-4816x15300
999,1000,April Miller,Shelter,Shelbychester,894-873-2652x23999

In [ ]:
food_listings

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,3/17/2025,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast
1,2,Soup,22,3/24/2025,791,Grocery Store,West James,Non-Vegetarian,Dinner
2,3,Fruits,46,3/28/2025,478,Catering Service,Lake Regina,Vegan,Breakfast
3,4,Fruits,15,3/16/2025,930,Restaurant,Kellytown,Vegan,Lunch
4,5,Soup,14,3/19/2025,279,Restaurant,Garciaport,Vegan,Dinner
...,...,...,...,...,...,...,...,...,...
995,996,Fish,15,3/30/2025,467,Catering Service,Phillipsfort,Vegan,Breakfast
996,997,Fish,22,3/18/2025,35,Grocery Store,Andersonmouth,Vegetarian,Breakfast
997,998,Fruits,6,3/22/2025,444,Restaurant,New Billy,Non-Vegetarian,Dinner
998,999,Pasta,15,3/30/2025,702,Supermarket,Lake Mistyton,Non-Vegetarian,Lunch
999,1000,Salad,18,3/19/2025,155,Supermarket,Charlesview,Non-Vegetarian,Dinner

In [ ]:
claims

     Claim_ID  Food_ID  Receiver_ID     Status        Timestamp
0           1      164          908    Pending    3/5/2025 5:26
1           2      353          391  Cancelled  3/11/2025 10:24
2           3      626          492  Completed   3/21/2025 0:59
3           4       61          933  Cancelled    3/4/2025 9:08
4           5      345          229    Pending  3/14/2025 15:17
..        ...      ...          ...        ...              ...
995       996      855          211  Completed  3/13/2025 19:40
996       997      980          746  Cancelled  3/17/2025 22:04
997       998      832          967  Cancelled  3/13/2025 18:00
998       999      917           90  Completed   3/1/2025 15:31
999      1000      596          950  Cancelled  3/13/2025 12:51

[1000 rows x 5 columns]

## Check the data values and Clean the dataset

### Providers dataset

In [ ]:
providers.shape

(1000, 6)

In [ ]:
providers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Provider_ID  1000 non-null   int64
 1   Name         1000 non-null   object
 2   Type         1000 non-null   object
 3   Address      1000 non-null   object
 4   City         1000 non-null   object
 5   Contact      1000 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.0+ KB

In [ ]:
pd.isnull(providers).sum()

Provider_ID    0
Name           0
Type           0
Address        0
City           0
Contact        0
dtype: int64

In [ ]:
providers_df = providers.copy()

In [ ]:
# --- CLEANING FUNCTION DEFINITIONS ---
"""Keep only digits from the contact number."""
def clean_contact_number(number):
    if pd.isna(number):
        return None
    # Remove all non-digit characters
    digits = re.sub(r'\D', '', str(number))
    return digits  # only digits remain

"""Remove newlines, commas, hyphens, extra spaces, and trim."""
def clean_text(text):
    if pd.isna(text):
        return None
    text = str(text)
    text = re.sub(r'[\n\r]+', ' ', text)     # Remove newlines
    text = re.sub(r'[,\\-]+', ' ', text)     # Remove commas and hyphens
    text = re.sub(r'\s+', ' ', text)         # Collapse multiple spaces
    return text.strip()

def clean_addr_text(text):
    if pd.isna(text):
        return None
    text = str(text)
    text = re.sub(r'[\n\r]+', ' ', text)     # Remove newlines
    text = re.sub(r'\s+', ' ', text)         # Collapse multiple spaces
    return text.strip()

In [ ]:
# Clean text fields (Name, Type, City)
text_cols = ['Name', 'Type', 'City']
for col in text_cols:
    providers_df[col] = providers_df[col].apply(clean_text)

In [ ]:
# Clean Address
providers_df['Address'] = providers_df['Address'].apply(clean_addr_text)

In [ ]:
# Clean contact numbers
providers_df['Contact'] = providers_df['Contact'].apply(clean_contact_number)

In [ ]:
# Ensure Provider_ID is integer type
providers_df = providers_df.astype({'Provider_ID': 'int64'})

In [ ]:
# --- Preview cleaned data ---
providers_df

,Provider_ID,Name,Type,Address,City,Contact
0,1,Gonzales Cochran,Supermarket,"74347 Christopher Extensions Andreamouth, OK 9...",New Jessica,16002200480
1,2,Nielsen Johnson and Fuller,Grocery Store,"91228 Hanson Stream Welchtown, OR 27136",East Sheena,192528389016297
2,3,Miller Black,Supermarket,"561 Martinez Point Suite 507 Guzmanchester, WA...",Lake Jesusview,0015172952206
3,4,Clark Prince and Williams,Grocery Store,"467 Bell Trail Suite 409 Port Jesus, IA 61188",Mendezmouth,5569448935401
4,5,Coleman Farley,Grocery Store,"078 Matthew Creek Apt. 319 Saraborough, MA 53978",Valentineside,1937146577
...,...,...,...,...,...,...
995,996,Vasquez Ruiz and Flowers,Restaurant,"84308 Justin Stravenue New Amberside, NE 53447",Williamview,131937876270682
996,997,Garza Williams,Catering Service,"08864 Figueroa Radial Suite 948 Jennaberg, AZ ...",East Rossside,0019244413963746
997,998,Novak Group,Grocery Store,"934 Zachary Run Melissamouth, WY 02729",Joshuastad,90364219693300
998,999,Moody Ltd,Grocery Store,"17580 Ernest Hills Lake Michaelmouth, OR 56416",Stevenchester,63730036644880
999,1000,Jenkins Brooks,Restaurant,"53390 Evans Rapids Suite 982 Lake Meghan, MO 4...",Brendantown,266324345895775

In [ ]:
# Save cleaned data
providers_df.to_csv("providers_data_cleaned.csv", index=False)
print("Cleaned data saved to providers_data_cleaned.csv")

Cleaned data saved to providers_data_cleaned.csv

In [ ]:
receivers.shape

(1000, 5)

In [ ]:
receivers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Receiver_ID  1000 non-null   int64
 1   Name         1000 non-null   object
 2   Type         1000 non-null   object
 3   City         1000 non-null   object
 4   Contact      1000 non-null   object
dtypes: int64(1), object(4)
memory usage: 39.2+ KB

In [ ]:
pd.isnull(receivers).sum()

Receiver_ID    0
Name           0
Type           0
City           0
Contact        0
dtype: int64

In [ ]:
receivers_df = receivers.copy()

In [ ]:
# Clean contact numbers
receivers_df['Contact'] = receivers_df['Contact'].apply(clean_contact_number)

In [ ]:
# Clean text fields (Name, Type, City)
text_cols = ['Name', 'Type', 'City']
for col in text_cols:
    receivers_df[col] = receivers_df[col].apply(clean_text)

In [ ]:
receivers_df

,Receiver_ID,Name,Type,City,Contact
0,1,Donald Gomez,Shelter,Port Carlburgh,9559225295
1,2,Laurie Ramos,Individual,Lewisburgh,7610421570
2,3,Ashley Mckee,NGO,South Randalltown,6910230094856
3,4,Erika Rose,NGO,South Shaneville,8296491111
4,5,John Romero,Individual,Bakerport,0674910154
...,...,...,...,...,...
995,996,Matthew Curtis,Shelter,Lanechester,12788944421289
996,997,Amanda Cain,NGO,New Steven,100149156015316
997,998,Theodore Briggs,Individual,South Sandra,93060994425031
998,999,Cheyenne Ramsey,NGO,Lake Jeffery,001326320481615300
999,1000,April Miller,Shelter,Shelbychester,894873265223999

In [ ]:
# Save cleaned data
receivers_df.to_csv("receivers_data_cleaned.csv", index=False)
print("Cleaned data saved to receivers_data_cleaned.csv")

Cleaned data saved to receivers_data_cleaned.csv

### Food_listings dataset

In [ ]:
food_listings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Food_ID        1000 non-null   int64
 1   Food_Name      1000 non-null   object
 2   Quantity       1000 non-null   int64
 3   Expiry_Date    1000 non-null   object
 4   Provider_ID    1000 non-null   int64
 5   Provider_Type  1000 non-null   object
 6   Location       1000 non-null   object
 7   Food_Type      1000 non-null   object
 8   Meal_Type      1000 non-null   object
dtypes: int64(3), object(6)
memory usage: 70.4+ KB

In [ ]:
food_listings.shape

(1000, 9)

In [ ]:
pd.isnull(food_listings).sum()

Food_ID          0
Food_Name        0
Quantity         0
Expiry_Date      0
Provider_ID      0
Provider_Type    0
Location         0
Food_Type        0
Meal_Type        0
dtype: int64

In [ ]:
food_listings_df = food_listings.copy()

In [ ]:
# --- Standardize formats ---
# Convert Expiry_Date to datetime
food_listings_df['Expiry_Date'] = pd.to_datetime(food_listings_df['Expiry_Date'], errors='coerce')

# Make sure Quantity is numeric and valid
food_listings_df['Quantity'] = pd.to_numeric(food_listings_df['Quantity'], errors='coerce')
food_listings_df = food_listings_df[food_listings_df['Quantity'] > 0]  # remove negatives/zeros

In [ ]:
# --- Standardize text ---
cols = ['Food_Name', 'Provider_Type', 'Location', 'Food_Type', 'Meal_Type']
for x in cols:
    food_listings_df[x] = food_listings_df[x].str.strip().str.title()

In [ ]:
# --- Remove duplicates ---
food_listings_df.drop_duplicates(inplace=True)

In [ ]:
# --- Optional: detect expired foods ---
today = pd.Timestamp('today')
expired = food_listings_df[food_listings_df['Expiry_Date'] < today]

In [ ]:
food_listings_df

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,2025-03-17,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast
1,2,Soup,22,2025-03-24,791,Grocery Store,West James,Non-Vegetarian,Dinner
2,3,Fruits,46,2025-03-28,478,Catering Service,Lake Regina,Vegan,Breakfast
3,4,Fruits,15,2025-03-16,930,Restaurant,Kellytown,Vegan,Lunch
4,5,Soup,14,2025-03-19,279,Restaurant,Garciaport,Vegan,Dinner
...,...,...,...,...,...,...,...,...,...
995,996,Fish,15,2025-03-30,467,Catering Service,Phillipsfort,Vegan,Breakfast
996,997,Fish,22,2025-03-18,35,Grocery Store,Andersonmouth,Vegetarian,Breakfast
997,998,Fruits,6,2025-03-22,444,Restaurant,New Billy,Non-Vegetarian,Dinner
998,999,Pasta,15,2025-03-30,702,Supermarket,Lake Mistyton,Non-Vegetarian,Lunch
999,1000,Salad,18,2025-03-19,155,Supermarket,Charlesview,Non-Vegetarian,Dinner

### Claims dataset

In [ ]:
claims.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Claim_ID     1000 non-null   int64
 1   Food_ID      1000 non-null   int64
 2   Receiver_ID  1000 non-null   int64
 3   Status       1000 non-null   object
 4   Timestamp    1000 non-null   object
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [ ]:
claims.shape

(1000, 5)

In [ ]:
pd.isnull(claims).sum()

Claim_ID       0
Food_ID        0
Receiver_ID    0
Status         0
Timestamp      0
dtype: int64

In [ ]:
claims_df = claims.copy()

In [ ]:
# --- Clean Claims Dataset ---

# Convert Timestamp to datetime for sorting or filtering
claims_df['Timestamp'] = pd.to_datetime(claims_df['Timestamp'], errors='coerce')

In [ ]:
# Standardize the Status column (consistent casing & spacing)
claims_df['Status'] = claims_df['Status'].str.strip().str.title()

In [ ]:
# Remove any duplicate claim records
claims_df.drop_duplicates(inplace=True)

In [ ]:
# Validate numeric columns (ensure integers, positive values)
claims_df = claims_df[
    (claims_df['Claim_ID'] > 0) &
    (claims_df['Food_ID'] > 0) &
    (claims_df['Receiver_ID'] > 0)
]

In [ ]:
# Optional — remove invalid timestamps (if any)
claims_df = claims_df[claims_df['Timestamp'].notna()]

In [ ]:
# Reset index for neatness
claims_df.reset_index(drop=True, inplace=True)

In [ ]:
# Verify the cleaning
print("Cleaned Claims Dataset:")
claims_df.info()
claims_df.head()

Cleaned Claims Dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Claim_ID     1000 non-null   int64
 1   Food_ID      1000 non-null   int64
 2   Receiver_ID  1000 non-null   int64
 3   Status       1000 non-null   object
 4   Timestamp    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 39.2+ KB

   Claim_ID  Food_ID  Receiver_ID     Status           Timestamp
0         1      164          908    Pending 2025-03-05 05:26:00
1         2      353          391  Cancelled 2025-03-11 10:24:00
2         3      626          492  Completed 2025-03-21 00:59:00
3         4       61          933  Cancelled 2025-03-04 09:08:00
4         5      345          229    Pending 2025-03-14 15:17:00

## Connect to SQL Database

In [ ]:
# Database connection
conn = sqlite3.connect("foodmanagement.db")
cursor = conn.cursor()

In [ ]:
#pip install sqlalchemy sqlite-utils
#pip install pymysql

In [ ]:
from sqlalchemy import create_engine, text

try:
    engine = create_engine("mysql+pymysql://root:Mrbean%40123456789d@localhost:3306/foodmanagement_db")

    with engine.connect() as conn:
        result = conn.execute(text("SELECT DATABASE();")).fetchone()
        print("Connected to:", result)
except Exception as e:
    print("Connection failed:", e)

Connected to: ('foodmanagement_db',)

In [ ]:
#  Create Tables with Foreign Keys
create_tables_sql = """
CREATE TABLE IF NOT EXISTS providers (
    Provider_ID INT PRIMARY KEY AUTO_INCREMENT,
    Name VARCHAR(255),
    Type VARCHAR(100),
    Address TEXT,
    City VARCHAR(100),
    Contact VARCHAR(50)
);

CREATE TABLE IF NOT EXISTS receivers (
    Receiver_ID INT PRIMARY KEY AUTO_INCREMENT,
    Name VARCHAR(255),
    Type VARCHAR(100),
    City VARCHAR(100),
    Contact VARCHAR(50)
);

CREATE TABLE IF NOT EXISTS food_listings (
    Food_ID INT PRIMARY KEY AUTO_INCREMENT,
    Food_Name VARCHAR(255),
    Quantity INT,
    Expiry_Date DATE,
    Provider_ID INT,
    Provider_Type VARCHAR(100),
    Location VARCHAR(255),
    Food_Type VARCHAR(100),
    Meal_Type VARCHAR(100),
    FOREIGN KEY (Provider_ID) REFERENCES providers(Provider_ID)
        ON UPDATE CASCADE ON DELETE SET NULL
);

CREATE TABLE IF NOT EXISTS claims (
    Claim_ID INT PRIMARY KEY AUTO_INCREMENT,
    Food_ID INT,
    Receiver_ID INT,
    Status VARCHAR(50),
    Timestamp DATETIME,
    FOREIGN KEY (Food_ID) REFERENCES food_listings(Food_ID)
        ON UPDATE CASCADE ON DELETE CASCADE,
    FOREIGN KEY (Receiver_ID) REFERENCES receivers(Receiver_ID)
        ON UPDATE CASCADE ON DELETE SET NULL
);
"""

In [ ]:
# Execute schema creation
with engine.begin() as conn:
    for statement in create_tables_sql.strip().split(";"):
        if statement.strip():
            conn.execute(text(statement))

In [ ]:
# Clean and format data
food_listings_df['Expiry_Date'] = pd.to_datetime(food_listings_df['Expiry_Date'], errors='coerce').dt.date
claims_df['Timestamp'] = pd.to_datetime(claims['Timestamp'], errors='coerce')

In [ ]:
#  Insert data into SQL tables
providers_df.to_sql('providers', con=engine, if_exists='append', index=False)
receivers_df.to_sql('receivers', con=engine, if_exists='append', index=False)
food_listings_df.to_sql('food_listings', con=engine, if_exists='append', index=False)
claims_df.to_sql('claims', con=engine, if_exists='append', index=False)

1000

#### Example Query

In [ ]:
#View all available food with provider details
query1 = """
SELECT f.Food_ID, f.Food_Name, f.Quantity, f.Expiry_Date, p.Name AS Provider_Name, p.City
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Provider_ID;
"""

with engine.connect() as conn:
    query1 = pd.read_sql(query1, conn).head()

query1

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_Name,City
0,1,Bread,43,2025-03-17,Figueroa Soto,South Kellyville
1,2,Soup,22,2025-03-24,Aguilar Group,West James
2,3,Fruits,46,2025-03-28,Lopez Roach and Roach,Lake Regina
3,4,Fruits,15,2025-03-16,Cannon Garcia,Kellytown
4,5,Soup,14,2025-03-19,Greene Wood and Hernandez,Garciaport

## 15 QUERIES

#### 1) Which cities have the most active food providers.

In [ ]:
# Providers per City

pd.read_sql( """
SELECT City, COUNT(*) AS Total_Providers
FROM providers
GROUP BY City
ORDER BY Total_Providers DESC;"""
,engine)

                         City  Total_Providers
0                   New Carol                3
1    South Christopherborough                3
2                  New Amanda                2
3            North Kevinhaven                2
4                   Lake Kyle                2
..                        ...              ...
958              Manningshire                1
959             East Rossside                1
960                Joshuastad                1
961             Stevenchester                1
962               Brendantown                1

[963 rows x 2 columns]

#### 2) Distribution of food receivers across cities.

In [ ]:
# Receivers per City

pd.read_sql( """
SELECT City, COUNT(*) AS Total_Receivers
FROM receivers
GROUP BY City
ORDER BY Total_Receivers DESC;"""
,engine)

                City  Total_Receivers
0    New Christopher                3
1       Spencermouth                2
2       Moorechester                2
3          Lake Mary                2
4         Smithshire                2
..               ...              ...
961      Lanechester                1
962       New Steven                1
963     South Sandra                1
964     Lake Jeffery                1
965    Shelbychester                1

[966 rows x 2 columns]

#### 3) Identify which type (e.g., restaurant, grocery) donates the most food.

In [ ]:
# Top Provider Types by Total Food Quantity

pd.read_sql( """
SELECT p.Type AS Provider_Type, SUM(f.Quantity) AS Total_Quantity_Donated
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Provider_ID
GROUP BY p.Type
ORDER BY Total_Quantity_Donated DESC;"""
,engine)

      Provider_Type  Total_Quantity_Donated
0        Restaurant                  6923.0
1       Supermarket                  6696.0
2  Catering Service                  6116.0
3     Grocery Store                  6059.0

#### 4) Who donates food most frequently.

In [ ]:
# Most Frequent Food Providers

pd.read_sql( """
SELECT p.Name AS Provider_Name, COUNT(f.Food_ID) AS Total_Donations
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Provider_ID
GROUP BY p.Provider_ID, p.Name
ORDER BY Total_Donations DESC
LIMIT 10;"""
,engine)

                Provider_Name  Total_Donations
0                 Barry Group                6
1                 Daniels Kim                5
2                 Smith Group                5
3                Campbell LLC                5
4                  Nelson LLC                4
5   Evans Wright and Mitchell                4
6               Garcia Hunter                4
7     Oliver Ross and Johnson                4
8  White Crawford and Pearson                4
9           Bradford Martinez                4

#### 5) Which cities have the highest number of food claims.

In [ ]:
# Highest Demand Cities (by Claims)

pd.read_sql( """
SELECT p.City, COUNT(c.Claim_ID) AS Total_Claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
JOIN providers p ON f.Provider_ID = p.Provider_ID
GROUP BY p.City
ORDER BY Total_Claims DESC;"""
,engine)

                 City  Total_Claims
0    East Heatherport            12
1    Lake Andrewmouth             9
2           Jamesfurt             9
3           New Carol             7
4       South Kathryn             7
..                ...           ...
463        Ramseyfort             1
464        East Aaron             1
465    Lake Coryhaven             1
466     Rodriguezview             1
467         New Billy             1

[468 rows x 2 columns]

#### 6) Which food items are in highest demand.

In [ ]:
# Top Food Items by Number of Claims

pd.read_sql( """
SELECT f.Food_Name, COUNT(c.Claim_ID) AS Claim_Count
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY f.Food_Name
ORDER BY Claim_Count DESC
LIMIT 10;"""
,engine)

    Food_Name  Claim_Count
0        Rice          122
1        Soup          114
2       Dairy          110
3        Fish          108
4       Salad          106
5     Chicken          102
6       Bread           94
7       Pasta           87
8  Vegetables           86
9      Fruits           71

#### 7) Completion rate and pending claims overview.

In [ ]:
# Claim Status Distribution

pd.read_sql( """
SELECT Status, COUNT(*) AS Total_Claims,
       ROUND(COUNT(*) * 100.0 / (SELECT COUNT(*) FROM claims), 2) AS Percentage
FROM claims
GROUP BY Status;"""
,engine)

      Status  Total_Claims  Percentage
0    Pending           325        32.5
1  Cancelled           336        33.6
2  Completed           339        33.9

#### 8) How much food each provider donates overall.

In [ ]:
# Food Quantity per Provider

pd.read_sql( """
SELECT p.Name AS Provider_Name, SUM(f.Quantity) AS Total_Quantity
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Provider_ID
GROUP BY p.Provider_ID, p.Name
ORDER BY Total_Quantity DESC;"""
,engine)

                      Provider_Name  Total_Quantity
0                       Barry Group           179.0
1         Evans Wright and Mitchell           158.0
2                       Smith Group           150.0
3                        Nelson LLC           142.0
4                        Ruiz Oneal           140.0
..                              ...             ...
632                  Gonzales Moore             1.0
633                 Norris Townsend             1.0
634                  Brown and Sons             1.0
635                       Mcgee PLC             1.0
636  Martinez Armstrong and Carroll             1.0

[637 rows x 2 columns]

#### 9) Typical donation sizes across provider types.

In [ ]:
# Average Quantity Donated per Provider Type

pd.read_sql( """
SELECT p.Type AS Provider_Type, ROUND(AVG(f.Quantity), 2) AS Avg_Quantity
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Provider_ID
GROUP BY p.Type;"""
,engine)

      Provider_Type  Avg_Quantity
0     Grocery Store         24.93
1  Catering Service         26.36
2        Restaurant         26.83
3       Supermarket         25.08

#### 10) Average food amount claimed by each receiver.

In [ ]:
# Average Quantity Claimed per Receiver

pd.read_sql( """
SELECT r.Name AS Receiver_Name, ROUND(AVG(f.Quantity), 2) AS Avg_Quantity_Claimed
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
JOIN receivers r ON c.Receiver_ID = r.Receiver_ID
GROUP BY r.Receiver_ID, r.Name
ORDER BY Avg_Quantity_Claimed DESC;"""
,engine)

          Receiver_Name  Avg_Quantity_Claimed
0           Nancy Jones                  50.0
1            Lisa Pitts                  50.0
2    Christopher Wright                  50.0
3           Nancy Silva                  50.0
4          Peggy Knight                  50.0
..                  ...                   ...
619       John Reynolds                   2.0
620     Matthew Johnson                   2.0
621      Kenneth Barnes                   2.0
622        Amanda Kline                   1.0
623       Joshua Hooper                   1.0

[624 rows x 2 columns]

#### 11) Which meal types (breakfast, lunch, dinner, snacks) are most requested.

In [ ]:
# Most Claimed Meal Type

pd.read_sql( """
SELECT f.Meal_Type, COUNT(c.Claim_ID) AS Total_Claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY f.Meal_Type
ORDER BY Total_Claims DESC;"""
,engine)

   Meal_Type  Total_Claims
0  Breakfast           278
1      Lunch           250
2     Snacks           240
3     Dinner           232

#### 12) Which food categories (e.g., perishable, packaged) are most donated.

In [ ]:
# Most Common Food Types Donated
pd.read_sql("""
SELECT f.Food_Type, COUNT(f.Food_ID) AS Total_Listings
FROM food_listings f
GROUP BY f.Food_Type
ORDER BY Total_Listings DESC;""",
engine)

        Food_Type  Total_Listings
0      Vegetarian             336
1           Vegan             334
2  Non-Vegetarian             330

#### 13) Detect items that may go to waste soon.

In [ ]:
# Food Near Expiry (Potential Wastage Risk)

pd.read_sql("""
SELECT Food_Name, Expiry_Date, Quantity
FROM food_listings
WHERE Expiry_Date BETWEEN CURDATE() AND DATE_ADD(CURDATE(), INTERVAL 90 DAY)
ORDER BY Expiry_Date ASC;""",
engine)

Empty DataFrame
Columns: [Food_Name, Expiry_Date, Quantity]
Index: []

In [ ]:
pd.read_sql("""
SELECT Food_Name, Expiry_Date, Quantity
FROM food_listings
WHERE Expiry_Date > CURDATE()
ORDER BY Expiry_Date ASC
LIMIT 10;
""", engine)

Empty DataFrame
Columns: [Food_Name, Expiry_Date, Quantity]
Index: []

In [ ]:
pd.read_sql("SELECT DISTINCT Expiry_Date FROM food_listings ORDER BY Expiry_Date;", engine)

   Expiry_Date
0   2025-03-16
1   2025-03-17
2   2025-03-18
3   2025-03-19
4   2025-03-20
5   2025-03-21
6   2025-03-22
7   2025-03-23
8   2025-03-24
9   2025-03-25
10  2025-03-26
11  2025-03-27
12  2025-03-28
13  2025-03-29
14  2025-03-30

#### Categorize food by expiry status

In [ ]:
pd.read_sql("""
SELECT
    Food_Name,
    Expiry_Date,
    Quantity,
    CASE
        WHEN Expiry_Date < CURDATE() THEN 'Expired'
        WHEN Expiry_Date BETWEEN CURDATE() AND DATE_ADD(CURDATE(), INTERVAL 7 DAY) THEN 'Expiring Soon'
        ELSE 'Safe'
    END AS Expiry_Status
FROM food_listings
ORDER BY Expiry_Date ASC
""", engine)

    Food_Name Expiry_Date  Quantity Expiry_Status
0      Fruits  2025-03-16        15       Expired
1        Soup  2025-03-16         4       Expired
2        Rice  2025-03-16        50       Expired
3        Rice  2025-03-16        30       Expired
4      Fruits  2025-03-16        13       Expired
..        ...         ...       ...           ...
995   Chicken  2025-03-30        32       Expired
996      Rice  2025-03-30        44       Expired
997   Chicken  2025-03-30        39       Expired
998      Fish  2025-03-30        15       Expired
999     Pasta  2025-03-30        15       Expired

[1000 rows x 4 columns]

#### 14) Measures which providers have the best distribution record.

In [ ]:
# Providers with Highest Successful Claims

pd.read_sql("""
SELECT p.Name AS Provider_Name, COUNT(c.Claim_ID) AS Successful_Claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
JOIN providers p ON f.Provider_ID = p.Provider_ID
WHERE c.Status = 'Completed'
GROUP BY p.Provider_ID, p.Name
ORDER BY Successful_Claims DESC
LIMIT 10;""",
engine)

                Provider_Name  Successful_Claims
0                 Barry Group                  5
1           Butler Richardson                  4
2                  Miller Inc                  4
3  Harper Blake and Alexander                  4
4    Barnes Castro and Curtis                  4
5                    Beck Inc                  3
6               Moore Flowers                  3
7                Campbell LLC                  3
8               Rogers Warren                  3
9                Mckinney Ltd                  3

#### 15) Compare total donated food vs total claimed to detect waste trends.

In [ ]:
# Total Food Donated vs Claimed (for Wastage Analysis)

pd.read_sql("""
SELECT
    (SELECT SUM(Quantity) FROM food_listings) AS Total_Donated,
    (SELECT SUM(f.Quantity)
     FROM claims c
     JOIN food_listings f ON c.Food_ID = f.Food_ID) AS Total_Claimed,
    (SELECT SUM(Quantity) FROM food_listings) -
    (SELECT SUM(f.Quantity)
     FROM claims c
     JOIN food_listings f ON c.Food_ID = f.Food_ID) AS Potential_Wastage;
""", engine)

   Total_Donated  Total_Claimed  Potential_Wastage
0        25794.0        25959.0             -165.0

## Given 13 Queries

### Food Providers & Receivers

#### 1) How many food providers and receivers are there in each city?

In [ ]:
pd.read_sql("""
SELECT
    City,
    COUNT(DISTINCT Provider_ID) AS Total_Providers,
    COUNT(DISTINCT Receiver_ID) AS Total_Receivers
FROM (
    SELECT City, Provider_ID, NULL AS Receiver_ID FROM providers
    UNION ALL
    SELECT City, NULL AS Provider_ID, Receiver_ID FROM receivers
) AS combined
GROUP BY City;"""
,engine)

                City  Total_Providers  Total_Receivers
0         Aaronshire                0                1
1           Adambury                1                0
2           Adamland                0                1
3          Adamsview                1                0
4         Adamsville                1                0
...              ...              ...              ...
1873       Yatesside                1                0
1874    Youngchester                1                0
1875     Zacharyview                0                1
1876    Zimmermanton                1                0
1877  Zimmermanville                1                0

[1878 rows x 3 columns]

#### 2) Which type of food provider contributes the most food?

In [ ]:
pd.read_sql("""
SELECT
    p.Type AS Provider_Type,
    SUM(f.Quantity) AS Total_Quantity_Donated
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Provider_ID
GROUP BY p.Type
ORDER BY Total_Quantity_Donated DESC
LIMIT 1;"""
, engine)

  Provider_Type  Total_Quantity_Donated
0    Restaurant                  6923.0

#### 3) What is the contact information of food providers in a specific city?

In [ ]:
pd.read_sql("""
SELECT
    Name AS Provider_Name,
    Type,
    Contact,
    Address
FROM providers
WHERE City = 'Washingtonville';"""           #--change city name as needed
, engine)

,Provider_Name,Type,Contact,Address
0,Curtis Lewis,Supermarket,152102781203301,"4770 Miller Light Suite 260 New Charlesville, ..."

#### 4) Which receivers have claimed the most food?

In [ ]:
pd.read_sql( """
SELECT
    r.Name AS Receiver_Name,
    COUNT(c.Claim_ID) AS Total_Claims
FROM claims c
JOIN receivers r ON c.Receiver_ID = r.Receiver_ID
GROUP BY r.Receiver_ID, r.Name
ORDER BY Total_Claims DESC;"""
,engine)

         Receiver_Name  Total_Claims
0         Scott Hunter             5
1    William Frederick             5
2         Matthew Webb             5
3       Anthony Garcia             5
4           Alvin West             4
..                 ...           ...
619       Alexis Hayes             1
620   Angelica Simmons             1
621    Brittany Taylor             1
622    Cheyenne Ramsey             1
623       April Miller             1

[624 rows x 2 columns]

### Food Listings & Availability

#### 5) What is the total quantity of food available from all providers?

In [ ]:
pd.read_sql( """
SELECT
    SUM(Quantity) AS Total_Quantity_Available
FROM food_listings
WHERE Expiry_Date >= CURDATE();"""            #-- exclude expired items
,engine)

  Total_Quantity_Available
0                     None

#### 6) Which city has the highest number of food listings?

In [ ]:
pd.read_sql( """
SELECT
    p.City,
    COUNT(f.Food_ID) AS Total_FoodListings
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Provider_ID
GROUP BY p.City
ORDER BY Total_FoodListings DESC
LIMIT 1;"""
,engine)

        City  Total_FoodListings
0  New Carol                   6

#### 7) What are the most commonly available food types?

In [ ]:
pd.read_sql( """
SELECT
    Food_Type,
    COUNT(*) AS Count
FROM food_listings
GROUP BY Food_Type
ORDER BY Count DESC
LIMIT 5;"""
,engine)

        Food_Type  Count
0      Vegetarian    336
1           Vegan    334
2  Non-Vegetarian    330

#### 8) How many food claims have been made for each food item?

In [ ]:
pd.read_sql( """
SELECT
    f.Food_Name,
    COUNT(c.Claim_ID) AS Total_Claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY f.Food_Name
ORDER BY Total_Claims DESC;"""
,engine)

    Food_Name  Total_Claims
0        Rice           122
1        Soup           114
2       Dairy           110
3        Fish           108
4       Salad           106
5     Chicken           102
6       Bread            94
7       Pasta            87
8  Vegetables            86
9      Fruits            71

#### 9) Which provider had the highest number of successful food claims?

In [ ]:
pd.read_sql( """
SELECT
    p.Name AS Provider_Name,
    COUNT(c.Claim_ID) AS Successful_Claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
JOIN providers p ON f.Provider_ID = p.Provider_ID
WHERE c.Status = 'Completed'
GROUP BY p.Provider_ID, p.Name
ORDER BY Successful_Claims DESC
LIMIT 1;"""
,engine)

  Provider_Name  Successful_Claims
0   Barry Group                  5

#### 10) What percentage of food claims are Completed vs Pending vs Cancelled?

In [ ]:
pd.read_sql( """
SELECT
    Status,
    COUNT(*) AS Count,
    ROUND(COUNT(*) * 100.0 / (SELECT COUNT(*) FROM claims), 2) AS Percentage
FROM claims
GROUP BY Status;"""
,engine)

      Status  Count  Percentage
0    Pending    325        32.5
1  Cancelled    336        33.6
2  Completed    339        33.9

### Analysis & Insights

#### 11) What is the average quantity of food claimed per receiver?

In [ ]:
pd.read_sql( """
SELECT
    r.Name AS Receiver_Name,
    ROUND(AVG(f.Quantity), 2) AS Avg_Quantity_Claimed
FROM claims c
JOIN receivers r ON c.Receiver_ID = r.Receiver_ID
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY r.Receiver_ID, r.Name
ORDER BY Avg_Quantity_Claimed DESC;"""
,engine)

          Receiver_Name  Avg_Quantity_Claimed
0           Nancy Jones                  50.0
1            Lisa Pitts                  50.0
2    Christopher Wright                  50.0
3           Nancy Silva                  50.0
4          Peggy Knight                  50.0
..                  ...                   ...
619       John Reynolds                   2.0
620     Matthew Johnson                   2.0
621      Kenneth Barnes                   2.0
622        Amanda Kline                   1.0
623       Joshua Hooper                   1.0

[624 rows x 2 columns]

#### 12) Which meal type (breakfast, lunch, dinner, snacks) is claimed the most?

In [ ]:
pd.read_sql( """
SELECT
    f.Meal_Type,
    COUNT(c.Claim_ID) AS Total_Claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY f.Meal_Type
ORDER BY Total_Claims DESC;"""
,engine)

   Meal_Type  Total_Claims
0  Breakfast           278
1      Lunch           250
2     Snacks           240
3     Dinner           232

#### 13) What is the total quantity of food donated by each provider?

In [ ]:
pd.read_sql( """
SELECT
    p.Name AS Provider_Name,
    SUM(f.Quantity) AS Total_Quantity_Donated
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Provider_ID
GROUP BY p.Provider_ID, p.Name
ORDER BY Total_Quantity_Donated DESC;"""
,engine)

                      Provider_Name  Total_Quantity_Donated
0                       Barry Group                   179.0
1         Evans Wright and Mitchell                   158.0
2                       Smith Group                   150.0
3                        Nelson LLC                   142.0
4                        Ruiz Oneal                   140.0
..                              ...                     ...
632                  Gonzales Moore                     1.0
633                 Norris Townsend                     1.0
634                  Brown and Sons                     1.0
635                       Mcgee PLC                     1.0
636  Martinez Armstrong and Carroll                     1.0

[637 rows x 2 columns]